Code Samples Review part 1/Chapter 7/twitter/app/controllers/statuses_controller.rb

  def show
    @status = Status.find(params[:id])
---
SELECT * FROM "statuses" WHERE ("statuses"."id" = 31)

  def create
    @status = Status.new(params[:status])
    @status.user = current_user

    respond_to do |format|
      if @status.save
---
INSERT INTO "statuses" ("truncated", "created_at", "updated_at", "source_url", "text", "user_id", "favourited", "in_reply_to_user_id", "source", "in_reply_to_status_id") VALUES('f', '2009-02-09 18:48:25', '2009-02-09 18:48:25', '', 'asdflijasdfl;jasd;lfjas;dlf', 1, 'f', NULL, 'web', NULL)