Code Samples Review part 1/Chapter 7/twitter/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "location", "profile_image_url", "crypted_password", "remember_token_expires_at", "updated_at", "favourites_count", "users_count", "url", "utc_offset", "remember_token", "followers_count", "protected", "description", "time_zone", "login", "friends_count", "email", "following") VALUES('', '141227b3d57d7d84b719188318e892f43faa831c', '2009-01-06 14:02:18', '', NULL, '6defb4b5b3b98eeee9dfcde41b352b4d45726096', NULL, '2009-01-06 14:02:18', 0, 0, NULL, NULL, NULL, 0, 'f', '', NULL, 'quire', 0, 'quire@example.com', 'f')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save